### Eksik Veriler

In [1]:
import pandas as pd
import numpy as np

In [6]:
SozlukVerisi={"Istanbul" : [30,29,np.nan],"Ankara":[20,np.nan,25],"Izmir":[40,39,38]}
havaDurumuDataFrame=pd.DataFrame(SozlukVerisi)

In [7]:
havaDurumuDataFrame #eksik veriler içeren veri setimiz

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

#### nan değerleri silmeye bakalım işe yarar mı

In [8]:
havaDurumuDataFrame.dropna() # nan değerleri silme satırlarda nan olanı siler  orjinali bozmaz

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [9]:
havaDurumuDataFrame.dropna(axis=1)  # nan değerleri silme stunlarda nan olanı siler

   Izmir
0     40
1     39
2     38

In [12]:
SozlukVerisi2={"Istanbul" : [30,29,np.nan],"Ankara":[20,np.nan,25],"Izmir":[40,39,38],"Antalya":[45,np.nan,np.nan]}
havaDurumuDataFrame2=pd.DataFrame(SozlukVerisi2)

In [13]:
havaDurumuDataFrame2

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

##### thresh ile kaç tane nan dan fazla olanları silmesi gerektiğini belirtebiliriz.

In [15]:
havaDurumuDataFrame2.dropna(axis=1,thresh=2) #2 nan dan fazla olanları silsin .

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

####  nan olan yerlere istenen değer atama

In [17]:
havaDurumuDataFrame2.fillna(20)   ## nan değerlere 20 ataması yaptık

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

#### Groupby metodu ile gruplama

In [28]:
maasSozlugu={"Departman" : ["yazılım","yazılım","Pazarlama","Pazarlama","Insan Kaynakları","Hukuk","Hukuk","Hukuk"],
             "Calısan Ismi":["Ahmet","Mehemt","Atil","Burak","Zeynep","Fatma","Hidir","Neslihan"],
             "Maas":[400,309,308,489,373,7641,632,364]}
maasDataFrame=pd.DataFrame(maasSozlugu)

In [29]:
maasDataFrame

          Departman Calısan Ismi  Maas
0           yazılım        Ahmet   400
1           yazılım       Mehemt   309
2         Pazarlama         Atil   308
3         Pazarlama        Burak   489
4  Insan Kaynakları       Zeynep   373
5             Hukuk        Fatma  7641
6             Hukuk        Hidir   632
7             Hukuk     Neslihan   364

In [30]:
gruplanmis= maasDataFrame.groupby("Departman")

In [31]:
gruplanmis.count() # gruplanmis verideki alanlara  satır sayılarını verir  kaç tane var

                  Calısan Ismi  Maas
Departman
Hukuk                        3     3
Insan Kaynakları             1     1
Pazarlama                    2     2
yazılım                      2     2

In [36]:
gruplanmis.mean("Maas") #ortalamayı getirir.

                    Maas
Departman
Hukuk             2879.0
Insan Kaynakları   373.0
Pazarlama          398.5
yazılım            354.5

In [37]:
gruplanmis.min()

                 Calısan Ismi  Maas
Departman
Hukuk                   Fatma   364
Insan Kaynakları       Zeynep   373
Pazarlama                Atil   308
yazılım                 Ahmet   309